controllers/SiteController.php

    public function actionBlog($id)
    {
        $article = Article::findOne($id);
---
SELECT * FROM `article` WHERE `id`='1'