views/site/blog.php

SELECT * FROM `user` WHERE `id`=1
---
    <h2>Комментарии</h2>
    <?php foreach($comments as $comment) { ?>
      <div class="comment">
        <h2><?= Html::encode($comment->user->firstName) ?></h2>