models/AboutPage.php

SELECT * FROM `about_page` WHERE `id`=1
---
  public function getAboutPage()
  {
      return AboutPage::findOne(['id' => 1]);