models/Address.php

    public function getAddressTag($tag)
    {
        return Address::findAll(['idTag' => TagAddress::getTag($tag)]);
---
SELECT * FROM `address` WHERE `idTag`=1