models/Address.php

  public function getCoordinates()
  {
    return Address::find()->select(['address','width', 'height'], 'DISTINCT')->all();;
---
SELECT DISTINCT `address`, `width`, `height` FROM `address`