models/Address.php

SELECT * FROM `address`
---
  public function getAddress()
  {
      return Address::find()->all();

SELECT * FROM `address` WHERE `id`=2
---
  public function getAddressName($id)
  {
      return Address::findOne(['id' => $id])->address;

SELECT * FROM `address` WHERE `idKeyWord`=1
---
  public function getAddressBoss()
  {
    return Address::findAll(['idKeyWord' => KeyWordAddress::getBoss()]);

SELECT * FROM `address` WHERE `idKeyWord`=2
---
  public function getAddressEarth()
  {
    return Address::findAll(['idKeyWord' => KeyWordAddress::getEarth()]);

SELECT * FROM `address` WHERE `idKeyWord`=3
---
  public function getAddressIce()
  {
    return Address::findAll(['idKeyWord' => KeyWordAddress::getIce()]);

SELECT DISTINCT `address`, `width`, `height` FROM `address`
---
  public function getCoordinates()
  {
    return Address::find()->select(['address','width', 'height'], 'DISTINCT')->all();;