models/Article.php

SELECT COUNT(*) FROM (SELECT * FROM `comment` WHERE (`status`=1) AND (`idArticle`=1) ORDER BY `date` DESC) `c`
SELECT * FROM `comment` WHERE (`status`=1) AND (`idArticle`=1) ORDER BY `date` DESC LIMIT 3
---
    public function getArticleComments()
    {
      $query = $this->getComments()->where(['status'=>1])->orderBy('date desc');
      $count = $query->count();
      $pagination = new Pagination(['totalCount' => $count, 'pageSize'=>3]);
      $comments = $query->offset($pagination->offset)
          ->limit($pagination->limit)
          ->all();