models/Article.php

SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
---
    public function getForIndex()
    {
        return Article::find()->orderBy('viewed desc')->limit(3)->all();

SELECT COUNT(*) FROM (SELECT * FROM `article` ORDER BY `viewed` DESC) `c`
SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
---
    public function getAll($pageSize = 3)
    {
        $query = Article::find()->orderBy('viewed desc');
        $count = $query->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize'=>$pageSize]);
        $articles = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `article` ORDER BY `date` DESC LIMIT 3
---
    public function getRecent()
    {
        return Article::find()->orderBy('date desc')->limit(3)->all();

SELECT COUNT(*) FROM (SELECT * FROM `article` ORDER BY `date` DESC) `c`
SELECT * FROM `article` ORDER BY `date` DESC LIMIT 3
---
    public function getRecentAll()
    {
         $query = Article::find()->orderBy('date desc');
         $count = $query->count();
         $pagination = new Pagination(['totalCount' => $count, 'pageSize'=>3]);
         $recent = $query->offset($pagination->offset)
             ->limit($pagination->limit)
             ->all();

SELECT COUNT(*) FROM (SELECT * FROM `comment` WHERE (`status`=1) AND (`idArticle`=2) ORDER BY `date` DESC) `c`
SELECT * FROM `comment` WHERE (`status`=1) AND (`idArticle`=2) ORDER BY `date` DESC LIMIT 3
---
    public function getArticleComments()
    {
      $query = $this->getComments()->where(['status'=>1])->orderBy('date desc');
      $count = $query->count();
      $pagination = new Pagination(['totalCount' => $count, 'pageSize'=>3]);
      $comments = $query->offset($pagination->offset)
          ->limit($pagination->limit)
          ->all();

UPDATE `article` SET `viewed`=16 WHERE `id`=2
---
    public function viewedCounter()
    {
        $this->viewed += 1;
        return $this->save(false);