models/Category.php

SELECT * FROM `category` WHERE count > 0 ORDER BY `count` DESC
---
    public static function getAll()
    {
        return Category::find()->where('count > 0')->orderBy('count desc')->all();

SELECT COUNT(*) FROM `article` WHERE `idCategory`='4'
SELECT * FROM `article` WHERE `idCategory`='4' LIMIT 3
---
    public static function getArticlesByCategory($id)
    {
        $query = Article::find()->where(['idCategory'=>$id]);
        $count = $query->count();
        if ($count < 1) return false;
        $pagination = new Pagination(['totalCount' => $count, 'pageSize'=>3]);
        $articles = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();