models/Coach.php

  public function getCoaches()
  {
      return Coach::find()->all();
---
SELECT * FROM `coach`