models/Contacts.php

  public function getContacst($id = 1)
  {
      return Contacts::findOne(['id' => $id]);
---
SELECT * FROM `contact` WHERE `id`=1