models/IndexPage.php

  public function getIndexPage()
  {
      return IndexPage::findOne(['id' => 1]);
---
SELECT * FROM `index_page` WHERE `id`=1