models/KeyWordAddress.php

SELECT * FROM `key_word_address` WHERE `name`='boss'
---
  public function getBoss()
  {
    return KeyWordAddress::findOne(['name' => 'boss'])->id;

SELECT * FROM `key_word_address` WHERE `name`='earth'
---
  public function getEarth()
  {
    return KeyWordAddress::findOne(['name' => 'earth'])->id;

SELECT * FROM `key_word_address` WHERE `name`='ice'
---
  public function getIce()
  {
    return KeyWordAddress::findOne(['name' => 'ice'])->id;