models/News.php

SELECT * FROM `news` ORDER BY `priority` DESC LIMIT 3
---
    public function getForIndex()
    {
        return News::find()->orderBy('priority desc')->limit(3)->all();