models/Program.php

  public function getInfo()
  {
      $listprogram = Program::find()->all();
---
SELECT * FROM `program`

  public function getPrograms()
  {
      return Program::find()->all();
---
SELECT * FROM `program`