models/Sbor.php

    public function getCount()
    {
        return Sbor::find()->count() > 0 ? true : false;
---
SELECT COUNT(*) FROM `sbor`