models/Stock.php

  public function getAll()
  {
      return Stock::find()->orderBy('priority DESC, date DESC')->all();
---
SELECT * FROM `stock` ORDER BY `priority` DESC, `date` DESC