models/TagAddress.php

SELECT * FROM `tag_address` WHERE `name`='boss'
---
    public function getTag($tag)
    {
        return TagAddress::findOne(['name' => $tag])->id;