models/TaskProgram.php

    public function getRepeat($taskId, $programId)
    {
      return TaskProgram::findOne(['idProgram' => $programId, 'idTask' => $taskId]);
---
SELECT `idTask` FROM `task_program` WHERE `idProgram`=1