models/Task.php

SELECT * FROM `task` WHERE `id`=1
---
  public function getTaskForIndex($id)
  {
      $task = Task::findOne(['id' => $id]);