models/TimeTraining.php

  public function getTime($id)
  {
      return TimeTraining::findAll(['idTraining' => $id]);
---
SELECT * FROM `time_training` WHERE `idTraining`=1