models/TimeTraining.php

SELECT * FROM `time_training` WHERE `id`='8'
---
    public function getTime($id)
    {
        return TimeTraining::findOne(['id' => $id]);