models/Training.php

SELECT * FROM `training` WHERE `idType` IN (1, 'earth')
---
  public function getEarth()
  {
      $listtraining = Training::findAll(['idType' => TypeTraining::getIdEarth()]);

SELECT * FROM `training` WHERE `idType` IN (2, 'ice')
---
  public function getIce()
  {
      $listtraining = Training::findAll(['idType' => TypeTraining::getIdIce()]);