models/Trainer.php

  public function getAll()
  {
      return Trainer::find()->orderBy('priority DESC, date DESC')->all();
---
SELECT * FROM `trainer` ORDER BY `priority` DESC, `date` DESC