models/TypeTraining.php

SELECT * FROM `type_training` WHERE `name`='earth'
---
  public function getIdEarth()
  {
      return TypeTraining::findOne(['name' => 'earth']);

SELECT * FROM `type_training` WHERE `name`='ice'
---
  public function getIdIce()
  {
      return TypeTraining::findOne(['name' => 'ice']);