models/User.php

SELECT * FROM `user` WHERE `id`=2
---
    public static function findIdentity($id)
    {
        return User::findOne($id);